In [2]:
import pandas as pd

In [21]:
#Cargamos los datos de los avistamientos de UFOs en USA

data = pd.read_csv('http://bit.ly/uforeports')
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## Liberandonos de los datos Nulos o NAN:

In [5]:
# isnull() nos muestra un dataset con True en los campos donde existan datos nulos
data.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [6]:
# notnull() nos muestra un dataset con True en los campos donde no existan datos nulos
data.notnull().head()

   City  Colors Reported  Shape Reported  State  Time
0  True            False            True   True  True
1  True            False            True   True  True
2  True            False            True   True  True
3  True            False            True   True  True
4  True            False            True   True  True

In [7]:
# Estadisticos de datos nulos, por cada columna:
# ¿cuantas filas nulas hay en la columna city?

data.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [9]:
# ¿cuales son las filas nulas de la columna city?
# Regresa el dataset con las filas que cumplan la condicion
data[data.City.isnull()].head()

    City Colors Reported Shape Reported State             Time
21   NaN             NaN            NaN    LA   8/15/1943 0:00
22   NaN             NaN          LIGHT    LA   8/15/1943 0:00
204  NaN             NaN           DISK    CA  7/15/1952 12:30
241  NaN            BLUE           DISK    MT   7/4/1953 14:00
613  NaN             NaN           DISK    NV   7/1/1960 12:00

## Indices:

In [10]:
#muestra los indices de las filas
data.index

RangeIndex(start=0, stop=18241, step=1)

In [11]:
#muestra los indices de las columnas:
data.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [12]:
#Localizar el valor de una columna mediante su indice:

#muestra el valor de State en la fila 0.
data.loc[0,'State']

'NY'

In [13]:
# Ahora bien, podemos cambiar o reemplazar el indice que pandas coloca por defecto al dataset
# (0,1,2...n), por una columna del mismo dataset. es decir, hace que un columna sea index:

data.set_index('City', inplace=True)

In [18]:
# Mostremos el data set:
data.head()

# Quitamos el nombre
data.index.name = None
data.head()

                     Colors Reported Shape Reported State             Time
Ithaca                           NaN       TRIANGLE    NY   6/1/1930 22:00
Willingboro                      NaN          OTHER    NJ  6/30/1930 20:00
Holyoke                          NaN           OVAL    CO  2/15/1931 14:00
Abilene                          NaN           DISK    KS   6/1/1931 13:00
New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [16]:
# Ahora podemos buscar que valor tiene una columna para ese index:
data.loc['Abilene', 'Shape Reported']

City
Abilene        DISK
Abilene    TRIANGLE
Abilene      SPHERE
Abilene         NaN
Abilene         NaN
Name: Shape Reported, dtype: object

In [23]:
# Reestablecer indices numericos
# Quitamos el nombre
data.index.name = None 

data.reset_index(inplace=True)
data.head()

,level_0,City,Colors Reported,Shape Reported,State,Time
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [25]:
#Ahora necesitamos renombrar la columna de ciudades:

data.rename(columns={'index':'City'}, inplace=True)
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# Buscar datos por posiciones:

### Muestra las filas del 0 al 3 y todas las columnas:

In [27]:
data.loc[[0,1,2,3], :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3      Abilene             NaN           DISK    KS   6/1/1931 13:00

#### Muestra las filas del 2 al 5 (formato de rango) , y todas las columnas

In [30]:
data.loc[2:5,:]

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30

#### Muestra todas las filas pero solo la columna ciudad

In [33]:
data.loc[:, 'City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

#### Muestra todas las filas y el rango de columnas comprendidas entre City y State

In [35]:
data.loc[:, 'City':'State'].head()

                   City Colors Reported Shape Reported State
0                Ithaca             NaN       TRIANGLE    NY
1           Willingboro             NaN          OTHER    NJ
2               Holyoke             NaN           OVAL    CO
3               Abilene             NaN           DISK    KS
4  New York Worlds Fair             NaN          LIGHT    NY

#### Muestra todas las filas y solo las columnas City y State

In [36]:
data.loc[:, ['City','State']].head()

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [37]:
#Metricas sobre un data set:

data.describe()
# Para cada columna, calcula el total de elementos no nulos,
# el total de elementos unicos, el elemento que mas aparece en cada columna y su frecuencia

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

### Cual es el estado donde se han registrado la mayor cantidad de avistamientos?

In [38]:
data.describe().loc['top','State']

'CA'

## Reduccion de Memoria:

In [39]:
# utilizaremos otro data set para este ejemplo:
# data de la cantidad de bebidas alcoholicas consumidas por continente..

drinks= pd.read_csv('http://bit.ly/drinksbycountry')
data.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [40]:
# Nos muestra la informacion basica del data set:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
country                         193 non-null object
beer_servings                   193 non-null int64
spirit_servings                 193 non-null int64
wine_servings                   193 non-null int64
total_litres_of_pure_alcohol    193 non-null float64
continent                       193 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 7.6+ KB

In [41]:
#Si queremos saber mas acerca de la memoria:
drinks.memory_usage()

Index                             40
country                          772
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                        772
dtype: int64

In [42]:
#Memoria en Bytes:   
drinks.memory_usage(deep=True)

Index                             40
country                         7184
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                       6928
dtype: int64

### Podemos observar que continent es la serie que mas memoria ocupa, junto a country, pero el caso de continent, es porque existe mucha redundancia en las columnas, si mostramos los elementos unicos de continent vemos que solamente hay 6:

In [43]:
drinks.continent.unique()

array(['Asia', 'Europe', 'Africa', 'North America', 'South America',
       'Oceania'], dtype=object)

#### Lo que sucede es que cada contienente se esta repitiendo en más de una fila, y como son de tipo Object, su tamaño va aumentando.

#### Pandas tiene un tipo de dato especial llamado "category", este tipo de dato sustituye a nivel de memoria, las ocurrencias de un conjunto de datos denttro de una columna, por numeros enteros. 

#### A cada elemento del conjunto le asigna un entero, y las ocurrencias de ese elemento del conjunto las sustiuye por ese entero dentro del dataframe, de esta forma, la lista de elementos de strings solo aparece una vez.

### Es una forma de normalizacion:

In [44]:
# Si cambiamos el tipo de dato de la columna contient:
drinks['continent'] = drinks.continent.astype('category')

#Imprimimos los tipos de datos:
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [45]:
#Los datos siguen igual:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [47]:
#pero en memoria se organizan de esta forma:
# Index - Category
drinks.continent.cat.codes.head()

0    1
1    2
2    0
3    2
4    0
dtype: int8

In [48]:
#Lo que hace que su tamaño se reduzca a tan solo 512 bytes:
drinks.memory_usage(deep=True)

Index                             40
country                         7184
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                        512
dtype: int64

#### Este tipo de trucos no es aplicable para todos los casos, si el conjunto de datos tiene muchos elementos, la memoria tiende a duplicarse, veamos un ejemplo con la columna country:

In [49]:
#vemos la cantidad de elementos:
drinks.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola',
       'Antigua & Barbuda', 'Argentina', 'Armenia', 'Australia',
       'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bosnia-Herzegovina', 'Botswana', 'Brazil', 'Brunei',
       'Bulgaria', 'Burkina Faso', 'Burundi', "Cote d'Ivoire",
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile', 'China', 'Colombia',
       'Comoros', 'Congo', 'Cook Islands', 'Costa Rica', 'Croatia',
       'Cuba', 'Cyprus', 'Czech Republic', 'North Korea', 'DR Congo',
       'Denmark', 'Djibouti', 'Dominica', 'Dominican Republic', 'Ecuador',
       'Egypt', 'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon', 'Gambia',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Grenada', 'Guatemala',
       'Guinea', 'Guinea-Bissau', 'Guyana', 'Haiti', 'Honduras',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan',
       'Kazakhstan', 'Kenya', 'Kiribati', 'Kuwait', 'Kyrgyzstan', 'Laos',
       'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Micronesia', 'Monaco', 'Mongolia', 'Montenegro',
       'Morocco', 'Mozambique', 'Myanmar', 'Namibia', 'Nauru', 'Nepal',
       'Netherlands', 'New Zealand', 'Nicaragua', 'Niger', 'Nigeria',
       'Niue', 'Norway', 'Oman', 'Pakistan', 'Palau', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Qatar', 'South Korea', 'Moldova', 'Romania',
       'Russian Federation', 'Rwanda', 'St. Kitts & Nevis', 'St. Lucia',
       'St. Vincent & the Grenadines', 'Samoa', 'San Marino',
       'Sao Tome & Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'Spain', 'Sri Lanka',
       'Sudan', 'Suriname', 'Swaziland', 'Sweden', 'Switzerland', 'Syria',
       'Tajikistan', 'Thailand', 'Macedonia', 'Timor-Leste', 'Togo',
       'Tonga', 'Trinidad & Tobago', 'Tunisia', 'Turkey', 'Turkmenistan',
       'Tuvalu', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'Tanzania', 'USA', 'Uruguay', 'Uzbekistan',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [50]:
#Si Aplicamos el metodo anterior:
drinks['country'] = drinks.country.astype('category')

#vemos que la memoria pasa de ocupar 7184 a 10642:
drinks.memory_usage(deep=True)

Index                              40
country                         10642
beer_servings                    1544
spirit_servings                  1544
wine_servings                    1544
total_litres_of_pure_alcohol     1544
continent                         512
dtype: int64

In [55]:
#Se vuelve a colocar de forma normal:
drinks['country'] = drinks.country.astype('object')
drinks.memory_usage(deep=True)

Index                             40
country                         7184
beer_servings                   1544
spirit_servings                 1544
wine_servings                   1544
total_litres_of_pure_alcohol    1544
continent                        512
dtype: int64